"""Задания по стилю кода и именованию переменных."""
import math

# напиши команду, которая проверяет, ссылаются ли
# переменные spam и eggs на один и тот же объект в пямяти
spam = None
eggs = None

print(spam is eggs)

# придумай название для переменной, которая хранит список
# активных студентов, оставь этот список пустым
active_students = []

# назови переменную, которая хранит текущее количество студентов в потоке
students_count = len(active_students)

# придумай две переменных для обозначения самого маленького и самого большого
# числа в диапазоне и запиши в них числа 1 и 45
min_value = 1
max_value = 45

# создай константу для хранения числа Пи и запиши в неё первые 10 знаков
PI_NUMBER = round(math.pi, 9)
